{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "AguafinaScript",
    "1": "AlexBrush",
    "2": "Allura",
    "3": "Canterbury",
    "4": "GreatVibes",
    "5": "Holligate Signature",
    "6": "I Love Glitter",
    "7": "James Fajardo",
    "8": "OpenSans",
    "9": "alsscrp"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "AguafinaScript": "0",
    "AlexBrush": "1",
    "Allura": "2",
    "Canterbury": "3",
    "GreatVibes": "4",
    "Holligate Signature": "5",
    "I Love Glitter": "6",
    "James Fajardo": "7",
    "OpenSans": "8",
    "alsscrp": "9"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.39.3"
}
